dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_processing.c
/***************************************************************************//**
* \file cy_capsense_processing.c
* \version 1.1
*
* \brief
* This file provides the source code for the Data Processing module functions.
* The Data Processing module is responsible for the low-level raw count
* processing provided by the sensing module, maintaining baseline and
* difference values and performing high-level widget processing like
* updating button status or calculating slider position.
*
********************************************************************************
* \copyright
* Copyright 2018-2019, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_syslib.h"
#include <stddef.h>
#include <string.h>
#include "cy_capsense_common.h"
#include "cy_capsense_processing.h"
#include "cy_capsense_filter.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_centroid.h"


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeAllStatuses
****************************************************************************//**
*
* Performs initialization of all statuses, debounce counters and touch positions
* of all the widgets.
*
* The initialization includes the following tasks:
* - Reset the debounce counters of all the widgets.
* - Reset the number of touches.
* - Reset the position filter history for slider and touchpad widgets.
* - Clear all status of widgets and sensors.
* - Enable all the widgets.
*
* Calling this function is accompanied by 
* - Cy_CapSense_InitializeAllBaselines().
* - Cy_CapSense_InitializeAllFilters().
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeAllStatuses(const cy_stc_capsense_context_t * context)
{
    uint32_t widgetId;

    for(widgetId = context->ptrCommonConfig->numWd; widgetId-- > 0u;)
    {
        Cy_CapSense_InitializeWidgetStatus(widgetId, context);
        Cy_CapSense_InitializeWidgetGestures(widgetId, context);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeWidgetStatus
****************************************************************************//**
*
* Performs initialization of all statuses, debounce counters and touch positions
* of the specified widget.
*
* The initialization includes:
* - Resets the debounce counter of the widget.
* - Resets the number of touches.
* - Resets the position filter history for slider and touchpad widgets.
* - Clears widget and sensor statuses.
* - Enables the widget.
*
* The Button and Matrix Button widgets have individual debounce counter per
* sensor for the CSD widgets and per node for the CSX widgets.
*
* The Slider and Touchpad widgets have a single debounce counter per widget.
*
* The Proximity widget has two debounce counters per sensor. One for the
* proximity event and second for the touch event.
*
* All debounce counters during initialization are set to the value of the
* onDebounce widget parameter.
*
* Calling this function is accompanied by 
* - Cy_CapSense_InitializeWidgetBaseline().
* - Cy_CapSense_InitializeWidgetFilter().
* 
* \param widgetId
* Specifies the ID number of a widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeWidgetStatus(
                uint32_t widgetId, 
                const cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    uint32_t filterSize;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdCfg->ptrWdContext;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdCfg->ptrSnsContext;
    uint32_t snsNumber = ptrWdCfg->numSns;
    cy_stc_capsense_position_t * ptrHistory;

    /* Clear widget statuses (Non active, Not disabled, Working) */
    ptrWdCxt->status &= (uint8_t)~(CY_CAPSENSE_WD_ACTIVE_MASK |
                                   CY_CAPSENSE_WD_DISABLE_MASK |
                                   CY_CAPSENSE_WD_WORKING_MASK);
    /* Clear sensor status */
    for (snsIndex = snsNumber; snsIndex-- >0u;)
    {
        ptrSnsCxt->status &= (uint8_t)~(CY_CAPSENSE_SNS_TOUCH_STATUS_MASK | CY_CAPSENSE_SNS_PROX_STATUS_MASK);
        ptrSnsCxt++;
    }

    /* Reset debounce counters */
    switch (ptrWdCfg->wdType)
    {
        case (uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E:
        case (uint8_t)CY_CAPSENSE_WD_BUTTON_E:
            /* Each button requires one debounce counter */
            (void)memset(ptrWdCfg->ptrDebounceArr, (int32_t)ptrWdCxt->onDebounce, (size_t)snsNumber);
            break;
        case (uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E:
        case (uint8_t)CY_CAPSENSE_WD_RADIAL_SLIDER_E:
        case (uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E:
            /* Each widget requires one debounce counter */
            if (ptrWdCfg->senseMethod == (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E)
            {
                *(ptrWdCfg->ptrDebounceArr) = ptrWdCxt->onDebounce;
            }
            else
            {
                /*
                * CSX Touchpad has debounce located in another place. Moreover,
                * debounce counter is initialized at ID assignment, so no need
                * to do it here.
                */
            }
            break;
        case (uint8_t)CY_CAPSENSE_WD_PROXIMITY_E:
            /* Proximity widgets have 2 debounce counters per sensor (for touch and prox detection) */
            (void)memset(ptrWdCfg->ptrDebounceArr, (int32_t)ptrWdCxt->onDebounce, (size_t)(snsNumber << 1u));
            break;
        default:
            break;
    }

    /* Reset touch numbers */
    switch (ptrWdCfg->wdType)
    {
        case (uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E:
        case (uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E:
        case (uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E:
        case (uint8_t)CY_CAPSENSE_WD_RADIAL_SLIDER_E:
            /* Clean number of touches */
            ptrWdCxt->wdTouch.numPosition = CY_CAPSENSE_POSITION_NONE;
            if (0u != (ptrWdCfg->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_MASK))
            {
                ptrWdCfg->ptrPosFilterHistory->numPosition = CY_CAPSENSE_POSITION_NONE;
            }
            break;
        default:
            break;
    }

    /* Reset ballistic displacement */
    if (0u != (ptrWdCfg->centroidConfig & CY_CAPSENSE_CENTROID_BALLISTIC_MASK))
    {
        ptrWdCxt->xDelta = 0;
        ptrWdCxt->yDelta = 0;
        ptrWdCfg->ptrBallisticContext->oldTouchNumber = 0u;
    }

    /* Reset touch history */
    if (0u != (ptrWdCfg->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_MASK))
    {
        switch (ptrWdCfg->wdType)
        {
            case (uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E:
                /* Clean position filter history */
                if (ptrWdCfg->senseMethod == (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E)
                {
                    /* Reset all history IDs to undefined state */
                    ptrHistory = ptrWdCfg->ptrPosFilterHistory->ptrPosition;
                    filterSize = (ptrWdCfg->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_SIZE_MASK) >> CY_CAPSENSE_POSITION_FILTERS_SIZE_OFFSET;
                    for (snsIndex = 0u; snsIndex < CY_CAPSENSE_MAX_CENTROIDS; snsIndex++)
                    {
                        ptrHistory->id = CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED;
                        ptrHistory += filterSize;
                    }
                }
                break;
            default:
                break;
        }
        /* Init Adaptive IIR filter */
        if (0u != (ptrWdCfg->posFilterConfig & CY_CAPSENSE_POSITION_AIIR_MASK))
        {
            Cy_CapSense_AdaptiveFilterInitialize_Lib(&ptrWdCfg->aiirConfig,
                        ptrWdCfg->ptrPosFilterHistory->ptrPosition);
        }
    }
}


