dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_processing.c
    for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
    {
        ptrSnsCxtSns = ptrSnsCxtCh;
        ptrHistorySns = ptrHistoryCh;
        ptrHistoryLowSns = ptrHistoryLowCh;
        for (snsIndex = 0u; snsIndex < ptrWdConfig->numSns; snsIndex++)    
        {
            Cy_CapSense_FtRunEnabledFiltersInternal(ptrWdConfig, ptrSnsCxtSns, ptrHistorySns, ptrHistoryLowSns);

            result |= Cy_CapSense_FtUpdateBaseline(ptrWdConfig->ptrWdContext, ptrSnsCxtSns, context);
            Cy_CapSense_DpUpdateDifferences(ptrWdConfig->ptrWdContext, ptrSnsCxtSns);

            ptrSnsCxtSns++;
            ptrHistorySns += snsHistorySize;
            if(NULL != ptrHistoryLowSns)
            {
                ptrHistoryLowSns++;
            }
        }

        ptrSnsCxtCh += context->ptrCommonConfig->numSns;
        ptrHistoryCh += context->ptrCommonConfig->numSns * snsHistorySize;
        if(NULL != ptrHistoryLowCh)
        {
            ptrHistoryLowCh += context->ptrCommonConfig->numSns;
        }
    }

    if(CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn)
    {
        ptrSnsCxtSns = ptrWdConfig->ptrSnsContext;
        for (snsIndex = ptrWdConfig->numSns; snsIndex-- > 0u;)
        {
            Cy_CapSense_RunMfsFiltering(ptrSnsCxtSns, context);
            ptrSnsCxtSns++;
        }
    }
    
    return result;
}

/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessCsxWidgetStatus
****************************************************************************//**
*
* Updates the status of the CSX widget in the Data Structure.
*
* This function determines the type of widget and runs the appropriate function
* that implements the status update algorithm for this type of widget.
*
* When the widget-specific processing completes this function updates the 
* sensor and widget status registers in the data structure.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_DpProcessCsxWidgetStatus(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_context_t * context)
{
    switch (ptrWdConfig->wdType)
    {
        case (uint8_t)CY_CAPSENSE_WD_BUTTON_E:
        case (uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E:
            Cy_CapSense_DpProcessButton(ptrWdConfig, context);
            break;

        case (uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E:
            Cy_CapSense_DpProcessCsxTouchpad(ptrWdConfig, context);
            break;

    default:
        CY_ASSERT(0 != 0);
        break;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessCsxSensorRawCountsExt
****************************************************************************//**
*
* Performs customized processing of the CSX sensor raw counts.
*
* If all bits are set at once, the default processing order will take place.
* For a custom order, this function can be called multiple times and execute
* one task at a time.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
* \param ptrSnsContext    
* The pointer to the sensor context structure.
*
* \param ptrSnsRawHistory    
* The pointer to the filter history.
*
* \param ptrSnsRawHistoryLow    
* The pointer to the extended filter history.
*
* \param mode         
* The bit-mask with the data processing tasks to be executed.
* The mode parameters can take the following values:
* - CY_CAPSENSE_PROCESS_FILTER     (0x01) Run Firmware Filter
* - CY_CAPSENSE_PROCESS_BASELINE   (0x02) Update Baselines
* - CY_CAPSENSE_PROCESS_DIFFCOUNTS (0x04) Update Difference Counts
* - CY_CAPSENSE_PROCESS_ALL               Execute all tasks
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified sensor processing operation:
* - CY_RET_SUCCESS if operation was successfully completed;
* - CY_CAPSENSE_PROCESS_BASELINE_FAILED if baseline processing of any
* sensor of the specified widget failed. The result is concatenated with the index
* of failed sensor.
*
*******************************************************************************/
uint32_t Cy_CapSense_DpProcessCsxSensorRawCountsExt(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_sensor_context_t * ptrSnsContext,
                uint16_t * ptrSnsRawHistory,
                uint8_t * ptrSnsRawHistoryLow,
                uint32_t mode,
                const cy_stc_capsense_context_t * context)
{
    uint32_t  result = CY_RET_SUCCESS;
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;

    if (0u != (mode & CY_CAPSENSE_PROCESS_FILTER))
    {
        Cy_CapSense_FtRunEnabledFiltersInternal(ptrWdConfig,
                                                ptrSnsContext,
                                                ptrSnsRawHistory,
                                                ptrSnsRawHistoryLow);
    }

    if (0u != (mode & CY_CAPSENSE_PROCESS_BASELINE))
    {
        result = Cy_CapSense_FtUpdateBaseline(ptrWdCxt, ptrSnsContext, context);
    }
    if (0u != (mode & CY_CAPSENSE_PROCESS_DIFFCOUNTS))
    {
        Cy_CapSense_DpUpdateDifferences(ptrWdCxt, ptrSnsContext);
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessCsdWidgetRawCounts
****************************************************************************//**
*
* Performs default processing of the raw counts of the specified CSD widget.
*
* The processing includes the following tasks:
* - Run Filters.
* - Update Baselines.
* - Update Differences.
* The same process is applied to all the sensors of the specified widget.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget processing operation:
* - Zero - if operation was successfully completed.
* - Non-zero - if baseline processing of any sensor of the specified widget
* failed. The result is concatenated with the index of failed sensor.
*
*******************************************************************************/
uint32_t Cy_CapSense_DpProcessCsdWidgetRawCounts(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                const cy_stc_capsense_context_t * context)
{
    uint32_t result = CY_RET_SUCCESS;
    uint32_t snsIndex;
    uint32_t snsHistorySize;
    uint32_t freqChIndex;
    uint32_t freqChNumber;
    uint16_t * ptrHistoryCh;
    uint16_t * ptrHistorySns;
    uint8_t * ptrHistoryLowCh = NULL;
    uint8_t * ptrHistoryLowSns = NULL;
    cy_stc_capsense_sensor_context_t * ptrSnsCxtCh;
    cy_stc_capsense_sensor_context_t * ptrSnsCxtSns;
    cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNEHistory = ptrWdConfig->ptrNoiseEnvelope;

    snsHistorySize = (uint32_t)ptrWdConfig->rawFilterConfig & CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_MASK;
    freqChNumber = (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn) ? 3u : 1u;

    ptrSnsCxtCh = &ptrWdConfig->ptrSnsContext[0u];
    ptrHistoryCh = &ptrWdConfig->ptrRawFilterHistory[0u];
    if(CY_CAPSENSE_IIR_FILTER_PERFORMANCE == (ptrWdConfig->rawFilterConfig & CY_CAPSENSE_RC_FILTER_IIR_MODE_MASK))
    {
        ptrHistoryLowCh = &ptrWdConfig->ptrRawFilterHistoryLow[0u];
    }
        
